app/views/players/index.html.erb

			<div class="grid_2 omega stats">
				matches: <%= player.games.size %><br/>
---
SELECT "games".* FROM "games" ORDER BY created_at DESC