app/controllers/games_controller.rb

SELECT "games".* FROM "games" ORDER BY created_at DESC
---
  def index
    @games = Game.order('created_at DESC')

INSERT INTO "games" ("updated_at", "player_two_id", "created_at", "result", "player_one_id") VALUES ('2011-07-23 09:43:06.303518', 2, '2011-07-23 09:43:06.303518', NULL, 1)
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = 5 LIMIT 1
UPDATE "games" SET "updated_at" = '2011-07-24 19:31:05.145016', "player_two_id" = 1 WHERE "games"."id" = 5
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])