app/controllers/players_controller.rb

SELECT "players".* FROM "players" ORDER BY rating DESC
SELECT "games".* FROM "games" ORDER BY created_at DESC
---
  def index
    @players = Player.order('rating DESC')
    @games = Game.order('created_at DESC')

INSERT INTO "players" ("avatar", "updated_at", "name", "created_at", "rating") VALUES ('http://a2.twimg.com/profile_images/1448904597/pelocorto_reasonably_small.png', '2011-07-24 19:39:11.561813', '@alvaroyuste', '2011-07-24 19:39:11.561813', 1000)
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save